Autodesk.Navisworks.Api.SelectionSourceCollection
A collection of SelectionSources

Autodesk.Navisworks.Api.SelectionSourceCollection.#ctor
Create an empty collection

Autodesk.Navisworks.Api.SelectionSourceCollection.#ctor(Autodesk.Navisworks.Api.SelectionSourceCollection)
Create a collection that is a copy of from
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed

Autodesk.Navisworks.Api.SelectionSourceCollection.Add(Autodesk.Navisworks.Api.SelectionSource)
Adds an item to the .
item: The object to add to the .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.SelectionSourceCollection.AddRange(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.SelectionSource})
Add the items of the specified collection to the SelectionSourceCollection
from: The collection to add items from

Autodesk.Navisworks.Api.SelectionSourceCollection.Clear
Removes all items from the .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.SelectionSourceCollection.Contains(Autodesk.Navisworks.Api.SelectionSource)
Determines whether the SelectionSourceCollection contains a specific value.

Autodesk.Navisworks.Api.SelectionSourceCollection.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.SelectionSource})
Sets the contents of the collection to the items in from
from: The collection to copy contents from

Autodesk.Navisworks.Api.SelectionSourceCollection.CopyTo(Autodesk.Navisworks.Api.SelectionSource[],System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
Throws System.ArgumentOutOfRangeException: arrayIndex is less than 0.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentException: array is multidimensional.-or-arrayIndex is equal to or greater than the length of array.-or-The number of elements in the source  is greater than the available space from arrayIndex to the end of the destination array.-or-Type T cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.SelectionSourceCollection.CopyTo(System.Collections.Generic.ICollection{Autodesk.Navisworks.Api.SelectionSource})
Copies the contents of the collection into to
to: The collection to copy contents into

Autodesk.Navisworks.Api.SelectionSourceCollection.Count
Gets the number of elements contained in the collection.

Autodesk.Navisworks.Api.SelectionSourceCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.SelectionSourceCollection.IndexOf(Autodesk.Navisworks.Api.SelectionSource)
Determines the index of a specific item in the SelectionSourceCollection

Autodesk.Navisworks.Api.SelectionSourceCollection.Insert(System.Int32,Autodesk.Navisworks.Api.SelectionSource)
Inserts an item to the  at the specified index.
item: The object to insert into the .
index: The zero-based index at which item should be inserted.
Throws System.NotSupportedException: The  is read-only.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .

Autodesk.Navisworks.Api.SelectionSourceCollection.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SelectionSourceCollection.Item(System.Int32)


Autodesk.Navisworks.Api.SelectionSourceCollection.Remove(Autodesk.Navisworks.Api.SelectionSource)
Removes the first occurrence of a specific item from the collection.
item: The object to remove from the collection.
Returns: true if item was successfully removed from the collection; otherwise, false. This method also returns false if item is not found in the original collection.
Throws System.NotSupportedException: The collection is read-only.

Autodesk.Navisworks.Api.SelectionSourceCollection.RemoveAt(System.Int32)
Removes the  item at the specified index.
index: The zero-based index of the item to remove.
Throws System.NotSupportedException: The  is read-only.
Throws System.ArgumentOutOfRangeException: index is not a valid index in the .

Autodesk.Navisworks.Api.SelectionSourceCollection.ValueEquals(Autodesk.Navisworks.Api.SelectionSourceCollection)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.SelectionSourceCollection.ValueEquals(Autodesk.Navisworks.Api.SelectionSourceCollection,Autodesk.Navisworks.Api.SelectionSourceCollection)
Compares the two references 'By Value'